//Объектно-ориентированное программирование на языке C++
#include<iostream>
using namespace std;

//Объявляя структуру или класс мы создаем новый тип данных (пользовательский тип данных).
class Point
{
	double x;
	double y;
};

//#define STRUCT_POINT

void main()
{
	setlocale(LC_ALL, "");

#if defined STRUCT_POINT
	int a;		//Объявление переменной 'a' типа 'int'
	Point A;	//Объявление переменной 'A' типа 'Point'
				//Создание объекта 'A' типа 'Point'
				//Создание экзмепляра 'A' структуры 'Point'
	A.x = 2;
	A.y = 3;
	cout << A.x << "\t" << A.y << endl;

	Point* pA = &A;
	cout << pA->x << "\t" << pA->y << endl;
#endif // STRUCT_POINT

	Point A;
	cout << A.x << "\t" << A.y << endl;
}

/*
-------------------------------------------------------------
.  - Оператор прямого доступа (Point operator)
-> - Оператор косвенного доступа (Arrow operator)
-------------------------------------------------------------
*/

/*
-------------------------------------------------------------
				OOP concepts:

-------------------------------------------------------------
*/